app/controllers/matches_controller.rb

  def show
    @match = Match.find(params[:id])
---
SELECT * FROM "match" WHERE ("match"."id" = 1)

  def edit
    @match = Match.find(params[:id])
---
SELECT * FROM "match" WHERE ("match"."id" = 1)